# SteelElemPatternIntermediateDistanceX Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemPatternIntermediateDistanceX Property
ParameterTypeId Class See Also
---
"Intermediate distance on side 1"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemPatternIntermediateDistanceX { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemPatternIntermediateDistanceX As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemPatternIntermediateDistanceX {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace